# GetInstances Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCFile..::..GetInstances Method
IFCFile Class See Also
---
Gets IFC instances of one particular type.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<IFCAnyHandle> GetInstances(
	string entityName,
	bool includeSubTypes
)
```

Visual Basic
---
```text
Public Function GetInstances ( _
	entityName As String, _
	includeSubTypes As Boolean _
) As IList(Of IFCAnyHandle)
```

Visual C++
---
```text
public:
IList<IFCAnyHandle^>^ GetInstances(
	String^ entityName,
	bool includeSubTypes
)
```

# ### Parameters
entityName
    Type: System..::..String The name of the instance type.
includeSubTypes
    Type: System..::..Boolean True to retrieve instances of sub types.
# ### Return Value
The instance handles.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
IFCFile Class
Autodesk.Revit.DB.IFC Namespace